//Вычислить корень уравнения
//f(x) = 0
//на отрезке[a; b] с точностью  = 10–6
//,
//используя заданный метод(М = 1 – метод половинного деления, М = 2 – метод
//	касательных, М = 3 – метод хорд) для заданных функций.Вычисление корня уравнения оформить в виде функции с функциональным параметром, параметры a, b,
//	, s – в виде аргументов по умолчанию.
//	Результат представить в виде таблицы(s – значение параметра, х – вычисленный корень уравнения, f(x) – значение функции в найденной точке х, k_iter – количество итераций цикла для получения корня с заданной точностью) :

// M = 3 (метод хорд)

#include <iostream>

using namespace std;

void main()
{

}